#ifndef PWM_H_
#define PWM_H_
/*************************************************************************

  Pwm.h

*************************************************************************/
/*===========================================================================
  include
===========================================================================*/
#include "ecrobot_interface.h"


/*===========================================================================
  define
===========================================================================*/
#define PWM_NUM 20		/* PWM値を格納する配列の大きさ */
#define PWM_MEAN_NUM 10	/* 平均値を格納する配列の大きさ */
#define PWM_MEAN_CYCLE 40	/* 平均値を格納する周期 */


/*===========================================================================
  Pwm値クラス [Pwm]
===========================================================================*/
/* 属性 */
typedef struct {
	signed char pwmValue[PWM_NUM];			/* PWM値を格納する配列 */
	signed char pwmMeanValue[PWM_MEAN_NUM];	/* PWM値の平均値を格納する配列 */
	U8 meanCounter;							/* 平均値を取得する間隔をカウント */
} Pwm;

/* 操作 */
void Pwm_init(Pwm* this);								/* 初期化操作 */
void Pwm_finish(Pwm* this);								/* 終了操作 */
void Pwm_updatePwm(Pwm* this, signed char pwmValue);	/* PWM値の更新 */
signed char Pwm_getPwm(Pwm* this);						/* PWM値を取得 */
signed char Pwm_getMeanPwm(Pwm* this);					/* PWM値の平均値を取得 */

#endif

