#ifndef SONARDATA_H_
#define SONARDATA_H_
/*************************************************************************

  SonarData.h

*************************************************************************/
/*===========================================================================
  include
===========================================================================*/
#include "ecrobot_interface.h"
#include "port_define.h"


/*===========================================================================
  define
===========================================================================*/


/*===========================================================================
  SonarData値クラス [SonarData]
===========================================================================*/
/* 属性 */
typedef struct {
	S32 sonarData;							/* 障害物までの距離 */
} SonarData;

/* 操作 */
void SonarData_init(SonarData* this);									/* 初期化操作 */
void SonarData_finish(SonarData* this);									/* 終了操作 */
void SonarData_update(SonarData* this);									/* 障害物までの距離を更新 */
S32 SonarData_get(SonarData* this);										/* 障害物までの距離を取得 */

#endif

